artillery.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 10
      arrivalRate: 15

before:
  flow:
    - log: 'Get auth token'
    - post:
        url: '/login'
        json:
          login: 'admin'
          password: 'admin'
        capture:
          - json: $.token
            as: token

scenarios:
  - flow:
      - post:
          url: '/boards'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            title: 'title'
            columns: []
          capture:
            - json: $.id
              as: id

      - get:
          url: '/boards'
          headers:
            authorization: 'Bearer {{ token }}'

      - get:
          url: '/boards/{{ id }}'
          headers:
            authorization: 'Bearer {{ token }}'

      - put:
          url: '/boards/{{ id }}'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            title: 'new title'
            columns: []

      - delete:
          url: '/boards/{{ id }}'
          headers:
            authorization: 'Bearer {{ token }}'